app/views/books/index.html.erb

  <tbody>
    <% @current_user.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 2]]