app/controllers/books_controller.rb

SELECT COUNT(*) FROM "books"
---
  def index
    @books = Book.page(1).per(2)

INSERT INTO "books" ("title", "author", "description", "URL", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    @book.user = current_user

    respond_to do |format|
      if @book.save