app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "cmad17@yahoo.com"], ["created_at", "2017-09-11 15:46:20.806062"], ["updated_at", "2017-09-11 15:46:20.806062"]]